html/20231125T181008--vscode__vscode.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>vscode</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231125T181008--vscode__vscode.html">vscode</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4360855">1. vscode</a>
<ul>
<li><a href="#orgdbdf1f0">1.1. vscode vs vim vs emacs lex fridman inspired</a></li>
<li><a href="#orgcc0094d">1.2. try out evil mode&#x2026;</a></li>
<li><a href="#org8d291af">1.3. vscode shortcuts</a></li>
<li><a href="#orgce2f226">1.4. vscode plugins</a></li>
<li><a href="#org07a693a">1.5. VScode github real life examples</a></li>
<li><a href="#org5fcca21">1.6. https://desktop.github.com/</a></li>
<li><a href="#org0da30d8">1.7. why vscode</a></li>
<li><a href="#org8db3615">1.8. Trying out other editors</a></li>
<li><a href="#org10c2976">1.9. Reason</a></li>
<li><a href="#orgc1ad2d7">1.10. Andrei karpathy emacs lex did it convince him</a></li>
<li><a href="#org4996a22">1.11. automatic formatting with prettier</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org4360855" class="outline-2">
<h2 id="org4360855"><span class="section-number-2">1.</span> vscode</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdbdf1f0" class="outline-3">
<h3 id="orgdbdf1f0"><span class="section-number-3">1.1.</span> vscode vs vim vs emacs lex fridman inspired</h3>
</div>
<div id="outline-container-orgcc0094d" class="outline-3">
<h3 id="orgcc0094d"><span class="section-number-3">1.2.</span> try out evil mode&#x2026;</h3>
<div class="outline-text-3" id="text-1-2">
<p>
it might be more practical to learn to use it instead of emacs bindings. when
you are in shell or when you are in vscode with vim plugin or when talking to
other programmers and when you are in a browser with vim extension for example.
</p>
</div>
</div>

<div id="outline-container-org8d291af" class="outline-3">
<h3 id="org8d291af"><span class="section-number-3">1.3.</span> vscode shortcuts</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><code>c-k c-t</code> - choose theme</li>
<li>syncing to other devices with github login in vs code&#x2026;</li>
<li><code>c-shift-p</code> - ope command pallet</li>
<li><code>f5</code> - run and debug ANY file</li>
<li>jupyter notebooks in vscode? what is it for</li>
<li><code>c-k c-o</code> - open a folder(opens up nautilus)</li>
<li><code>shift+alt+click/up/down</code> multiple cursors</li>
<li><code>ctrl+shift+k</code> - delete entire line</li>
<li><code>f2</code> - rename variable</li>
<li><code>c+shift+i</code> - format entire document</li>
<li><code>c+k c+f</code> - format selection</li>
<li><code>c+shift+[]</code> - fold unfold code</li>
<li>type "if" or "try" and then select some sugeested completion snippet..</li>
<li>emmet works just the same</li>
<li><code>c-`</code> open terminal</li>
<li><code>c-,</code> - open settings</li>
<li><code>C-1, C-2, C-3</code> - different windows</li>
<li>file-&gt;autosave - autosaves every little change</li>
<li><code>c-n</code> - create new file</li>
<li>live server/live preview - html/css editing on the fly</li>
<li><code>c+shift+g</code> git interface</li>
<li>run auto detected tasks(google when its useful)</li>
<li><code>c+k c+s</code> customize shortcuts</li>
<li>eslint extensions for smth many downloads</li>
</ul>
</div>
</div>
<div id="outline-container-orgce2f226" class="outline-3">
<h3 id="orgce2f226"><span class="section-number-3">1.4.</span> vscode plugins</h3>
</div>
<div id="outline-container-org07a693a" class="outline-3">
<h3 id="org07a693a"><span class="section-number-3">1.5.</span> VScode github real life examples</h3>
<div class="outline-text-3" id="text-1-5">
<p>
plugin name - IntelliCode API Usage Examples
</p>
</div>
</div>
<div id="outline-container-org5fcca21" class="outline-3">
<h3 id="org5fcca21"><span class="section-number-3">1.6.</span> <a href="https://desktop.github.com/">https://desktop.github.com/</a></h3>
</div>
<div id="outline-container-org0da30d8" class="outline-3">
<h3 id="org0da30d8"><span class="section-number-3">1.7.</span> why vscode</h3>
<div class="outline-text-3" id="text-1-7">
<p>
ar mane stabdo emacs?
</p>

<p>
pycharm is like an 18 wheeler truck and emacs is like your comfortable
toyota - Guido
</p>

<p>
Vscode is great. Its like a home i can go back to when I'm lost. But
Emacs is an adventure - Guy on youtube
</p>

<p>
<a href="https://www.youtube.com/watch?v=G5mtQhWNezQ&amp;ab_channel=LexClips">sita kalba lex su Guido</a>
</p>

<ul class="org-ul">
<li>lex (vscode now 20k hours emacs)</li>
<li>python create Guide Van Rossum (VSCODE now, 30 years emacs)</li>
<li>George hotz(vscode + vim)</li>
</ul>
</div>
</div>
<div id="outline-container-org8db3615" class="outline-3">
<h3 id="org8db3615"><span class="section-number-3">1.8.</span> Trying out other editors</h3>
<div class="outline-text-3" id="text-1-8">
<p>
I think it really depends on what someone wants out of Emacs. The
thread the other day on people who use both had a pretty strong choir
of people who use Org-mode for note taking and VS Code for dev work,
which makes perfect sense to me; Emacs guaranteed itself a place in my
workflow with Org-mode.
</p>

<p>
I think if you're satisfied with Emacs for now and you can concretely
point to packages and functionality in Emacs that you would not know
how to recreate in VS Code out of the gate, I would say there's not a
ton of reason to switch to VS Code. I'm largely in the same boat, know
the basics of some front-end web-dev, occasionally play around with CL
and elisp, all non-professionally.
</p>

<p>
Compatibility with a hypothetical future team will be dependent on
that team, and at the same time many of the guides/tutorials for Emacs
I've read encourage learning other editors and how they work in case
you run into an employment situation that won't work with Emacs for
whatever reason. Seems like good practice.
</p>
</div>
</div>
<div id="outline-container-org10c2976" class="outline-3">
<h3 id="org10c2976"><span class="section-number-3">1.9.</span> Reason</h3>
<div class="outline-text-3" id="text-1-9">
<p>
I think people overvalue this kind of thing. Vscode is going to be
around for quite a while. If you think it would improve your life, you
should use it. It might eventually go away in 15 years, but if it
does, you can spend a weekend switching to something else. That’s
hardly a reason to use a suboptimal tool until then. Of course, you
may prefer Emacs, and that’s fine too. Just saying, I think it’s
unwise to avoid an extremely healthy ecosystem and tool purely on the
grounds that it might not exist forever.
</p>
</div>
</div>
<div id="outline-container-orgc1ad2d7" class="outline-3">
<h3 id="orgc1ad2d7"><span class="section-number-3">1.10.</span> Andrei karpathy emacs lex did it convince him</h3>
</div>
<div id="outline-container-org4996a22" class="outline-3">
<h3 id="org4996a22"><span class="section-number-3">1.11.</span> automatic formatting with prettier</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<a href="https://youtube.com/shorts/dDtueNAFELo?si=EDK6Ospk9N38QY_L">https://youtube.com/shorts/dDtueNAFELo?si=EDK6Ospk9N38QY_L</a>
</p>
</div>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-vscode.html">vscode</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
